<?php
// config.php

// 设置时区，确保时间准确
date_default_timezone_set('Asia/Shanghai');

return [
    // 学期开始时间 (格式：Y-m-d H:i:s)
    'start_date' => '2026-03-05 06:30:00',
    
    // 学期结束时间
    'end_date'   => '2026-07-03 17:00:00',

    // 特殊假期（原本是工作日，但这天放假，如国庆节）
    // 格式：Y-m-d
    'holidays'   => [
        '2026-04-06', // 2026清明
        '2026-05-01', '2026-05-04', '2026-05-05', // 2026五一
        '2026-06-19', // 2026端午节
    ],

    // 特殊工作日（原本是周末，但这天补班）
    'workdays'   => [
        '2026-05-09', '2023-10-08'
    ]
];
?>
